Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Sometimes we cannot use an existing daemon because it is busy or its java version or jvm arguments are different.
zh_cn: 有时我们不能使用现有的守护进程，是因为它正忙或其 java 版本或 jvm 参数不同。

source: Sometimes you don't want depended on projects to be built when doing a partial build.
zh_cn: 有时候，在做局部构建时，你不想依赖的项目也进行构建。

source: Sometimes you want the library files of a subset of the configuration dependencies (e.g. of a single dependency).
zh_cn: 有时你想要配置依赖的某个子集（例如单个依赖）的 library 文件。

source: Sometimes you want to have a task whose behavior depends on a large or infinite number value range of parameters.
zh_cn: 有时你想要有这样一项任务，它的行为依赖于参数数值范围的一个大数或是无限的数字。

source: Sometimes you want to replace a task.
zh_cn: 有时您想要替换一个任务。

source: Sonar Properties can also be set from the command line, by setting a system property named exactly like the Sonar property in question.
zh_cn: Sonar 属性也可以从命令行中设置，通过设置一个系统属性，名称就像正在考虑中的 Sonar 属性。

source: Sophisticated builds may use the extensibility of Gradle to apply additional attributes to each platform, which can then be queried to specify particular includes, preprocessor macros or compiler arguments for a native binary.
zh_cn: 复杂的构建，可能使用 Gradle 的扩展性来把附加属性应用到每个platform中，然后可以查询为一个本地二进制包含了哪些特别指定的预处理器或者是编译器参数。

source: Source files can be located in the conventional location (src/${component.name}Test/cunit) or can be configured like any other source set.
zh_cn: 源文件可以位于约定的位置（src/${component.name}Test/cunit），或者是像其他源集一样配置到别的地方。

source: Source set properties
zh_cn: Source set 属性

source: Specifically, latest.someStatus will resolve to the highest module version that has status someStatus or a more mature status.
zh_cn: 具体而言，latest.someStatus 将会解析成有着someStatus 或更成熟状态的最高的模块版本。

source: Specifically, destinationDir, baseName and version properties of the archive tasks are preconfigured with defaults.
zh_cn: 特别是，归档任务的destinationDir、 baseName和version属性被预先配置了默认值。

source: Specifically, the plugin adds a Scala facet and a Scala compiler library that matches the Scala version on the project's class path.
zh_cn: 具体而言，该插件添加了一个 Scala facet 和一个匹配项目的类路径上的 Scala 版本的 Scala 编译器类库。

source: Specifically, the plugin adds a Scala nature and dependency container.
zh_cn: 具体而言，该插件添加一个 Scala 性质和依赖的容器。

source: Specifies the java home for the Gradle build process.
zh_cn: 为 Gradle 构建进程指定 java home目录。

source: Specifies the jvmargs used for the daemon process.
zh_cn: 指定用于该守护进程的 jvmargs。

source: Specifying a set of input files
zh_cn: 指定一组输入文件

source: Stack Trace Output
zh_cn: 堆栈跟踪输出

source: Standalone project
zh_cn: 独立项目

source: Standard Gradle plugins
zh_cn: 标准的 Gradle 插件

source: Starting with Gradle 1.10, it is possible to include only specific tests, based on the test name pattern.
zh_cn: 从Gradle 1.10 开始，可以根据测试的名称模式，只包含指定的测试。

source: Starting with Gradle 1.5 you can make these substitutions using dependency resolve rules:
zh_cn: 从 Gradle 1.5 开始，你可以使用依赖解析规则来进行这些替换：

source: Starts a Jetty instance and deploys the WAR to it.
zh_cn: 启动 Jetty 实例并将部署上 WAR 包。

source: Starts a Jetty instance and deploys the exploded web application to it.
zh_cn: 启动 Jetty 实例并将部署上 exploded web 应用程序。

source: Starts the application.
zh_cn: 启动应用程序。

source: Stops the Jetty instance.
zh_cn: 停止 Jetty 实例。

source: Structure your build
zh_cn: 构建结构化

source: Subsequent invocations of the gradle command will reuse the daemon, avoiding the startup costs.
zh_cn: Gradle 命令的后续调用将重用该守护进程，以避免启动开销。

source: Such a build is always executed as:
zh_cn: 这样的构建总是这样执行:

source: Such a conversion is possible if in the Gradle exclude rule the group as well as the module name is specified (as Maven needs both in contrast to Ivy).
zh_cn: 如果 Gradle 排除规则中group和module名字被指定的话（相比于Ivy，Maven对这两个都需要），这种转换是可能的。

source: Such a library dependency can be easily provided to source set associated with the executable component:
zh_cn: 这样的库依赖可以很方便地提供给source set关联上executable组件。

source: Such a task might be nicer to configure than an Ant task.
zh_cn: 这样的一个任务可能会比一个 Ant 任务更好配置。

source: Such and other dependency patterns are daily bread in the problem space of multi-project builds.
zh_cn: 在多项目构建中，这样或其他的依赖模式是很常见的。

source: Such enhanced tasks are either provided by you or are provided by Gradle.
zh_cn: 这种增强的任务可以由你提供，或由 Gradle 提供。

source: Such features include:
zh_cn: 这些功能包括︰

source: Such reports are another feature of dependency management.
zh_cn: 这些报告是依赖管理的另一个功能。

source: Summary
zh_cn: 总结

source: Superceeded by the sonar-runner plugin.
zh_cn: 由 sonar-runner插件取代。

source: Supersedes the sonar plugin.
zh_cn: 由 sonar插件取代。

source: Support for additional test frameworks.
zh_cn: 支持另外的测试框架。

source: Supports TestNG runner
zh_cn: 支持 TestNG runner

source: Supports both single module and multimodule projects
zh_cn: 支持单个模块和多模块项目

source: Supports custom module names (that differ from directory names)
zh_cn: 支持自定义模块名称 （即目录名称有所不同）

source: Supports packaging of sources and tests
zh_cn: 支持打包源代码和测试代码

source: Supports packaging war projects as jars if needed
zh_cn: 如果需要，支持把 war 项目打包为 jar 包

source: TBD
zh_cn: 待决定

source: TODO: which url, configure port, uses source files in place and can edit your files and reload.
zh_cn: 待添加：哪个URL，配置端口，使用源文件的 地方，可编辑你的文件，以及重新加载。

source: Tab completion in a CLI
zh_cn: 在 CLI 中的 tab 键完成

source: Table Table 23.5, “Java plugin - dependency configurations” shows the configurations added by the Java plugin.
zh_cn: 表表 23.5，“Java 插件 - 依赖配置”显示了 Java 插件添加的配置。

source: Table of Contents
zh_cn: 目录

source: Table 13.1. Project Properties
zh_cn: 表 13.1. Project属性

source: Table 16.1. Archive tasks - naming properties
zh_cn: 表 16.1. 归档任务-命名属性

source: Table 18.1. Log levels
zh_cn: 表 18.1. 日志级别

source: Table 18.2. Log level command-line options
zh_cn: 表 18.2. 日志级别的命令行选项

source: Table 18.3. Stacktrace command-line options
zh_cn: 表 18.3. 栈跟踪的命令行选项

source: Table 22.1. Language plugins
zh_cn: 表 22.1. 语言插件

source: Table 22.2. Language plugins
zh_cn: 表 22.2. 语言插件

source: Table 22.3. Integration plugins
zh_cn: 表 22.3. 集成插件

source: Table 22.4. Incubating integration plugins
zh_cn: 表 22.4. 孵化中的集成插件

source: Table 22.5. Software development plugins
zh_cn: 表 22.5. 软件开发插件

source: Table 22.6. Software development plugins
zh_cn: 表 22.6. 软件开发插件

source: Table 22.7. Base plugins
zh_cn: 表 22.7. 基本插件

source: Table 23.1. Java plugin - tasks
zh_cn: 表 23.1. Java 插件-任务

source: Table 23.10. Java plugin - Javadoc properties
zh_cn: 表 23.10. Java 插件 - Javadoc 属性

source: Table 23.11. Java plugin - Clean properties
zh_cn: 表 23.11. Java 插件 - Clean 性能

source: Table 23.12. Java plugin - ProcessResources properties
zh_cn: 表 23.12. Java 插件-ProcessResources 属性

source: Table 23.13. Java plugin - Compile properties
zh_cn: 表 23.13. Java 插件- Compile属性

source: Table 23.14. Java plugin - test properties
zh_cn: 表 23.14. Java 插件 - test属性

source: Table 23.2. Java plugin - source set tasks
zh_cn: 表 23.2. Java 插件-源集任务

source: Table 23.3. Java plugin - lifecycle tasks
zh_cn: 表 23.3. Java 插件-生命周期任务

source: Table 23.4. Java plugin - default project layout
zh_cn: 表 23.4. Java 插件-默认项目布局

source: Table 23.5. Java plugin - dependency configurations
zh_cn: 表23.5. Java插件 ​​- 依赖配置

source: Table 23.6. Java plugin - source set dependency configurations
zh_cn: 表23.6. Java插件 ​​- 源集依赖配置

source: Table 23.7. Java plugin - directory properties
zh_cn: 表23.7. Java插件 ​​- 目录属性

source: Table 23.8. Java plugin - other properties
zh_cn: 表 23.8. Java 插件 - 其他属性

source: Table 23.9. Java plugin - source set properties
zh_cn: 表 23.9. Java 插件 - 源集属性

source: Table 24.1. Groovy plugin - tasks
zh_cn: 表 24.1. Groovy 插件 - 任务

source: Table 24.2. Groovy plugin - additional task dependencies
zh_cn: 表 24.2. Groovy 插件 - 额外的task 依赖

source: Table 24.3. Groovy plugin - project layout
zh_cn: 表 24.3. Groovy 插件 - 项目布局

source: Table 24.4. Groovy plugin - source set properties
zh_cn: 表 24.4. Groovy 插件 - source set 属性

source: Table 24.5. Groovy plugin - source set properties
zh_cn: 表 24.5. Groovy 的插件 - source set 属性

source: Table 24.6. Groovy plugin - GroovyCompile properties
zh_cn: 表 24.6. Groovy 插件 - GroovyCompile 属性

source: Table 25.1. Scala plugin - tasks
zh_cn: 表 25.1. Scala 插件 - 任务

source: Table 25.2. Scala plugin - additional task dependencies
zh_cn: 表 24.2. Scala感觉 插件 - 额外的task 依赖

source: Table 25.3. Scala plugin - project layout
zh_cn: 表 25.3. Scala 插件 - 项目布局

source: Table 25.4. Scala plugin - source set properties
zh_cn: 表 25.4. Scala 插件 - source set 属性

source: Table 25.5. Scala plugin - source set properties
zh_cn: 表 25.5. Scala 插件 - source set 属性

source: Table 26.1. War plugin - tasks
zh_cn: 表 26.1. War 插件 - 任务

source: Table 26.2. War plugin - additional task dependencies
zh_cn: 表 26.2. War 插件 - 额外的task 依赖

source: Table 26.3. War plugin - project layout
zh_cn: 表 26.3. War 插件 - 项目布局

source: Table 26.4. War plugin - directory properties
zh_cn: 表26.4. War插件 ​​- 目录属性

source: Table 27.1. Ear plugin - tasks
zh_cn: 表 27.1. Ear 插件 - tasks

source: Table 27.2. Ear plugin - additional task dependencies
zh_cn: 表 27.2. Ear 插件 - 额外的task 依赖

source: Table 27.3. Ear plugin - project layout
zh_cn: 表 27.3. Ear 插件 - 项目布局

source: Table 27.4. Ear plugin - directory properties
zh_cn: 表27.4. Ear插件 ​​- 目录属性

source: Table 28.1. Jetty plugin - tasks
zh_cn: 表 28.1. Jetty 插件 - 任务

source: Table 28.2. Jetty plugin - properties
zh_cn: 表 28.2. Jetty插件 - 属性

source: Table 29.1. Checkstyle plugin - tasks
zh_cn: 表 29.1. Checkstyle 插件 - tasks

source: Table 29.2. Checkstyle plugin - additional task dependencies
zh_cn: 表 29.2. Checkstyle 插件 - 额外的task 依赖

source: Table 29.3. Checkstyle plugin - project layout
zh_cn: 表 29.3. Checkstyle 插件 - 项目布局

source: Table 29.4. Checkstyle plugin - dependency configurations
zh_cn: 表29.4. Checkstyle 插件 ​​- 依赖配置

source: Table 30.1. CodeNarc plugin - tasks
zh_cn: 表 30.1. CodeNarc 插件 - 任务

source: Table 30.2. CodeNarc plugin - additional task dependencies
zh_cn: 表 30.2. CodeNarc 插件 - 附加的任务依赖

source: Table 30.3. CodeNarc plugin - project layout
zh_cn: 表 30.3. CodeNarc 插件 - 项目布局

source: Table 30.4. CodeNarc plugin - dependency configurations
zh_cn: 表30.4. CodeNarc 插件 ​​- 依赖配置

source: Table 31.1. FindBugs plugin - tasks
zh_cn: 表 31.1. FindBugs 插件 - 任务

source: Table 31.2. FindBugs plugin - additional task dependencies
zh_cn: 表 31.2. FindBugs 插件 - 附加的任务依赖

source: Table 31.3. FindBugs plugin - dependency configurations
zh_cn: 表31.3. FindBugs 插件 ​​- 依赖配置

source: Table 32.1. JDepend plugin - tasks
zh_cn: 表 32.1. JDepend 插件 - 任务

source: Table 32.2. JDepend plugin - additional task dependencies
zh_cn: 表 32.2. JDepend 插件 - 附加的任务依赖

source: Table 32.3. JDepend plugin - dependency configurations
zh_cn: 表32.3. JDepend 插件 ​​- 依赖配置

source: Table 33.1. PMD plugin - tasks
zh_cn: 表 33.1. PMD 插件 - 任务

source: Table 33.2. PMD plugin - additional task dependencies
zh_cn: 表 33.2. PMD 插件 - 附加的任务依赖

source: Table 33.3. PMD plugin - dependency configurations
zh_cn: 表33.3. PMD 插件 ​​- 依赖配置

source: Table 34.1. Gradle defaults for JaCoCo properties
zh_cn: 表 34.1. JaCoCo 属性的 Gradle 默认值

source: Table 34.2. Default values of the JaCoCo Task extension
zh_cn: 表 34.2. JaCoCo 任务扩展的默认值

source: Table 34.3. JaCoCo plugin - tasks
zh_cn: 表 34.3. JaCoCo 插件 - 任务

source: Table 34.4. JaCoCo plugin - dependency configurations
zh_cn: 表34.4. JaCoCo 插件 ​​- 依赖配置

source: Table 35.1. Sonar plugin - tasks
zh_cn: 表 35.1. 声纳插件 - 任务

source: Table 36.1. Gradle defaults for standard Sonar properties
zh_cn: 表 36.1. 标准 Sonar 属性的 Gradle 默认值

source: Table 36.2. Additional defaults when java-base plugin is applied
zh_cn: 表 36.2. 配置使用 java-base 插件时另外添加的默认值

source: Table 36.3. Additional defaults when java plugin is applied
zh_cn: 表 36.2. 配置使用 java 插件时另外添加的默认值

source: Table 36.4. Sonar Runner plugin - tasks
zh_cn: 表 36.4. Sonnar Runner 插件 - 任务

source: Table 37.1. OSGi methods
zh_cn: 表 37.1. OSGi 方法

source: Table 38.1. Eclipse plugin behavior
zh_cn: 表 38.1. Eclipse 插件行为

source: Table 38.2. Eclipse plugin - tasks
zh_cn: 表 38.2. Eclipse 插件 - 任务

source: Table 38.3. Configuration of the Eclipse plugin
zh_cn: 表 38.3. Eclipse 插件的配置

source: Table 38.4. Advanced configuration hooks
zh_cn: 表 38.4. 高级的配置hook

source: Table 39.1. IDEA plugin behavior
zh_cn: 表 39.1. IDEA插件行为

source: Table 39.2. IDEA plugin - Tasks
zh_cn: 表 39.2. IDEA插件 - 任务

source: Table 39.3. Configuration of the idea plugin
zh_cn: 表 39.3. idea 插件的配置

source: Table 39.4. Idea plugin hooks
zh_cn: 表 39.4. Idea 插件 hook

source: Table 40.1. ANTLR plugin - tasks
zh_cn: 表 40.1. ANTLR 插件 - 任务

source: Table 40.2. ANTLR plugin - additional task dependencies
zh_cn: 表 40.2. ANTLR 插件 - 附加的任务依赖

source: Table 40.3. ANTLR plugin - project layout
zh_cn: 表 40.3. ANTLR 插件 - 项目布局

source: Table 40.4. ANTLR plugin - source set properties
zh_cn: 表 40.4. ANTLR 插件 - source set 属性

source: Table 41.1. Project report plugin - tasks
zh_cn: 表 41.1. 项目报告插件 - 任务

source: Table 41.2. Project report plugin - convention properties
zh_cn: 表 41.2. 项目报告插件 - 约定属性

source: Table 42.1. Announce Plugin Notification Services
zh_cn: 表 42.1. Announce 插件通知服务

source: Table 44.1. Distribution plugin - tasks
zh_cn: 表 44.1. 分发插件 - 任务

source: Table 44.2. Multiple distributions - tasks
zh_cn: 表 44.2. 多分发 - 任务

source: Table 45.1. Application plugin - tasks
zh_cn: 表 45.1. 应用程序插件 - 任务

source: Table 46.1. Java library distribution plugin - tasks
zh_cn: 表 46.1. Java 库分发插件 - 任务

source: Table 47.1. Build Init plugin - tasks
zh_cn: 表 47.1. Build Init 插件 - 任务

source: Table 48.1. Wrapper plugin - tasks
zh_cn: 表 48.1. Wrapper 插件 - 任务

source: Table 49.1. Build Dashboard plugin - tasks
zh_cn: 表 49.1. Build Dashboard 插件 - 任务

source: Table 50.1. Dependency types
zh_cn: 表 50.1. 依赖类型

source: Table 50.2. Repository types
zh_cn: 表 50.2. 仓库类型

source: Table 52.1. Maven plugin - tasks
zh_cn: 表 52.1. Maven 插件 - 任务

source: Table 52.2. Maven plugin - properties
zh_cn: 表 52.2. Maven 插件 - 属性

source: Table 52.3. Protocol jars for Maven deployment
zh_cn: 表 52.3. Maven 部署的协议 jars

source: Table 52.4. Configuration elements of the MavenDeployer
zh_cn: 表 52.4. 配置 MavenDeployer 的元素

source: Table 52.5. Default Values for Maven POM generation
zh_cn: 表 52.5. Maven POM 生成的默认值

source: Take a look at the 'visual-studio' sample, or see VisualStudioExtension.getProjects() and VisualStudioExtension.getSolutions() for more details.
zh_cn: 更详细的信息，可以参考“visual-studio”例子，或者参阅 VisualStudioExtension.getProjects() 及 VisualStudioExtension.getSolutions() 。

source: Task Property
zh_cn: 任务属性

source: Task Tree
zh_cn: 任务树

source: Task dependencies
zh_cn: 任务依赖

source: Task dependencies are fully supported and parallel workers will start executing upstream tasks first.
zh_cn: 完全支持任务依赖，并且平行的workers将会首先开始执行上游的任务。

source: Task name
zh_cn: 任务名称

source: Task name abbreviation
zh_cn: 任务名称缩写

source: Task names can refer to tasks in the same project as the task, or to tasks in other projects.
zh_cn: 任务的名称可以指向同一个项目中的任务，或者其他项目中的任务。

source: Task ordering can be useful in a number of scenarios:
zh_cn: 任务排序在许多情况下可能很有用：

source: Task ordering is an incubating feature.
zh_cn: 任务排序还是一个孵化中的功能。

source: Task requested via task path from the command line (or Tooling API) causes the relevant project configured.
zh_cn: 通过从命令行 （或Tooling API）任务路径所请求的任务会导致相关的项目被配置。

source: Task rules
zh_cn: 任务规则

source: Tasks are also available through the tasks collection.
zh_cn: 任务也可以通过tasks集合来访问。

source: Tasks are simply POGOs, and when you declare a task, you can set the properties or call methods on the task object.
zh_cn: 任务是简单的POGOs，当你声明一个任务时，你可以在这个任务对象上设置属性或者是调用方法。

source: Tasks that do this are the Tar, Zip, Jar, War and Ear tasks.
zh_cn: 这样的任务有 Tar， Zip， Jar， War 及 Ear任务。

source: Test ANTLR grammar files.
zh_cn: 测试 ANTLR 语法文件。

source: Test Groovy sources.
zh_cn: Test Groovy 源代码。

source: Test Java source
zh_cn: Java 测试源代码

source: Test Scala sources.
zh_cn: Test Scala 源代码。

source: Test always executes every test that it detects.
zh_cn: test 会始终执行它检测到的每一个测试。

source: Test filtering feature has following characteristic:
zh_cn: 测试过滤功能具有以下的特征：

source: Test filtering supersedes the file-based test selection.
zh_cn: 测试过滤将会取代基于文件的测试选择。

source: Test resources
zh_cn: 测试资源

source: TestNG supports parameterizing test methods, allowing a particular test method to be executed multiple times with different inputs.
zh_cn: TestNG 支持参数化测试方法，允许一个特定的测试方法使用不同的输入执行多次。

source: Tests are executed in a separate JVM, isolated from the main build process.
zh_cn: 测试在单独的 JVM中执行，与main构建进程隔离。

source: Thanks to Gradle's default imports (see Appendix E, Existing IDE Support and how to cope without it) you could also write:
zh_cn: 由于 Gradle 的默认导入 （见附录 E，现有的 IDE 支持和如何应对不支持的情况），您还可以这样写：

source: That configuration is explicitly named as part of the dependency declaration.
zh_cn: 这个配置被显式地命名为这个依赖声明的一部分。

source: That is all.
zh_cn: 就这些了。

source: That is, a plugin can be applied multiple times.
zh_cn: 也就是说，一个插件可以被应用多次。

source: That is, any task that forks Java processes can be used to generate coverage information.
zh_cn: 也就意味着，任何fork Java 进程的任务都可以用于生成覆盖率信息。

source: That is, only systemProp. in the root project's gradle.properties file will be set as system properties.
zh_cn: 也就是，只有根项目gradle.properties文件里的systemProp.属性会被作为系统属性。

source: That is, the copy method is intended to be used by custom tasks (see Chapter 57, Writing Custom Task Classes) that need to copy files as part of their function.
zh_cn: 即，这个copy()方法旨在用于自定义任务 （见第 57 章，编写自定义任务类）中，需要文件复制作为其一部分功能的时候。

source: That was one reason why we have created a distribution of webapps.
zh_cn: 这是为什么我们创建一个 webapps 分发包的原因之一。

source: That way you have somehow expressed, what are your first level dependencies and what are transitive dependencies (see Section 50.4.8, “Optional attributes”).
zh_cn: 对于这种方法，你将用某种方式表达，你第一级的依赖项和传递依赖是什么（见第 50.4.8 条，“可选属性”）。

source: That's it.
zh_cn: 就是这样。

source: The "baseName" property has also been changed.
zh_cn: ”baseName“属性也被修改了。

source: The "basic" build init type is useful for creating a fresh new Gradle project.
zh_cn: “basic”构建初始化类型用于创建一个新的 Gradle 项目。

source: The "groovy-library" build init type is not inferable.
zh_cn: “groovy-library”构建初始化类型不是可推断的。

source: The "java-library" build init type is not inferable.
zh_cn: “Java-library”构建初始化类型不是可推断的。

source: The "pom" type can be used to convert an Apache Maven build to a Gradle build.
zh_cn: “pom”类型可以被用于把 Apache Maven 构建转换为 Gradle 构建。

source: The "scala-library" build init type is not inferable.
zh_cn: “scala-library”构建初始化类型不是可推断的。

source: The 'default' version is resolved to a specific version via a dependency resolve rule, which looks up the version in a corporate catalog of approved modules.
zh_cn: 这个“default”版本通过一个依赖解析规则被解析为一个特定的版本，这个规则将在一个核准模块的公司中查找该版本。

source: The 'should run after' ordering rule is similar but less strict as it will be ignored in two situations.
zh_cn: “应该在之后运行”的排序规则与其类似，但没有那么严格，因为它在两种情况下会被忽略。

source: The :api project also depends on :shared.
zh_cn: :api 项目还依赖于 :shared.

source: The JacocoReport task can be used to generate code coverage reports in different formats.
zh_cn: JacocoReport任务可以用于生成不同格式的代码覆盖率报告。

source: The MavenDeployer and the MavenInstaller both provide an API for this:
zh_cn: MavenDeployer和 MavenInstaller 都为此提供了一个 API：

source: The SonarProperty annotations in the API documentation show how properties of the plugin's object model get mapped to the corresponding Sonar properties.
zh_cn: 在 API 文档中的 SonarProperty 注解显示了插件的对象模型的属性是如何映射到相应的 Sonar 属性中的。

source: The Sync task extends the Copy task.
zh_cn: Sync任务继承了Copy任务。

source: The Test task's API allows you some control over how this happens.
zh_cn: Test任务的 API 可以让你控制什么时候开始。

source: The --offline command line switch tells Gradle to always use dependency modules from the cache, regardless if they are due to be checked again.
zh_cn: --offline 命令行开机告诉 Gradle 总是从缓存中使用依赖模块，无论它们是否被再次检查。

source: The --refresh-dependencies option tells Gradle to ignore all cached entries for resolved modules and artifacts.
zh_cn: --refresh-dependencies 选项告诉 Gradle 在解析模块和构件时忽略所有缓存条目。

source: The Configuration.files method always retrieves all artifacts of the whole configuration.
zh_cn: Configuration.files方法总是获取整个配置的所有 artifacts。

source: The Project instance
zh_cn: Project实例

source: The Project object provides some standard properties, which are available in your build script.
zh_cn: Project对象提供了一些在构建脚本中可用的标准的属性。

source: The Test task detects which classes are test classes by inspecting the compiled test classes.
zh_cn: Test任务通过检查编译过的测试类来检测哪些类是测试类。

source: The Test task generates the following results by default.
zh_cn: test任务默认情况下会生成以下结果。

source: The announce method takes two String arguments: The message to be sent, and the notification service to be used.
zh_cn: announce 方法有两个 String 参数: 要被发送的消息，以及要使用的通知服务。

source: The beforeMerged hook is executed with a domain object representing the existing file
zh_cn: beforeMerged的 hook 会随着一个表示现有文件的域对象执行

source: The build task does this.
zh_cn: build 任务能做到这一点。

source: The build task of the Java plugin is typically used to compile, test, and perform code style checks (if the CodeQuality plugin is used) of a single project.
zh_cn: Java 插件的build 通常用于一个项目的编译，测试和执行代码风格检查（如果使用了CodeQuality插件的话）。

source: The buildDashboard task does not depend on any other tasks.
zh_cn: buildDashboard 任务不依赖于任何其他任务。

source: The buildDependents task also tests all the projects that have a project lib dependency (in the testRuntime configuration) on the specified project.
zh_cn: buildDependents任务也用于测试依赖于（在testRuntime配置）指定项目的所有项目。

source: The buildNeeded task also tests all the projects from the project lib dependencies of the testRuntime configuration.
zh_cn: buildNeeded 任务也用于测试这个项目在testRuntime配置中依赖的所有库项目。

source: The clean task is an instance of Delete.
zh_cn: clean 任务是Delete的一个实例。

source: The configure() method takes a list as an argument and applies the configuration to the projects in this list.
zh_cn: configure()方法接受一个list作为参数，并将配置应用到这个list里的项目。

source: The copy method copies only the dependencies belonging explicitly to the configuration.
zh_cn: copy方法只复制明确属于配置的依赖。

source: The default configuration of a module contains undesired artifacts.
zh_cn: 一个模块的 default 配置包含了不希望有的 artifacts。

source: The forkEvery property specifies the maximum number of test classes to execute in a test process.
zh_cn: forkEvery属性指定了要在测试进程中执行的测试类的最大数。

source: The from() method accepts any of the arguments that the files() method does.
zh_cn: from()方法接受和files()方法一样的任何参数。

source: The groupId, artifactId, version and packaging elements used for the POM default to the values shown in the table below.
zh_cn: 下表展示了用于POM的groupId，artifactId，version和packaging元素的默认值。

source: The include method takes project paths as arguments.
zh_cn: include方法采用项目路径作为参数。

source: The includeFlat method takes directory names as an argument.
zh_cn: includeFlat方法将目录名称作为参数。

source: The init supports different build setup types.
zh_cn: init支持不同的构建安装程序类型。

source: The jar task creates a JAR file containing the class files and resources of the project.
zh_cn: Jar任务创建一个包含类文件和项目资源的 JAR 文件。

source: The javadoc task is an instance of Javadoc.
zh_cn: Javadoc任务是Javadoc的一个实例。

source: The maxParallelForks property specifies the maximum number of test processes to run at any given time.
zh_cn: MaxParallelForks属性指定在给定的时间可以运行的测试进程的最大数。

source: The rcCompiler extension is of type PreprocessingTool.
zh_cn: rcCompiler扩展是PreprocessingTool类型。

source: The sonar block in a subproject configures an object of type SonarProjectModel.
zh_cn: 在子项目中的sonar块配置的是一个SonarProjectModel类型的对象。

source: The sonar block in that project configures an object of type SonarRootModel.
zh_cn: 在该project 中的sonar 块配置的是一个SonarRootModel类型的对象。
